Revit 2027 API
PathOfTravel.Create Method
Overload List
Name | Description
Create(View, XYZ, XYZ) |  Creates a new path of travel between two points.
Create(View, XYZ, XYZ, PathOfTravelCalculationStatus) |  Creates a new path of travel between two points and provides creation result status.
Top
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace